[
  {
    "seed": 0,
    "solution": "Solve this math problem step by step. Put your final answer in \\boxed{}. Problem: Ben rolls 5 fair 12-sided dice.  The 12 faces of each die are numbered from 1 to 12. What is the probability that exactly two of the dice show an even number? Solution: \n<think>\nOkay, so Ben is rolling five fair 12-sided dice, and each die has faces numbered from 1 to 12. The problem is asking for the probability that exactly two of the dice show an even number. Hmm, let me try to figure this out step by step.\n\nFirst, I know that each die has 12 faces. So, the numbers on each die are 1 through 12. Now, half of these numbers are even, and half are odd, right? Let me check: from 1 to 12, the even numbers are 2, 4, 6, 8, 10, 12. That's six numbers, so six even faces. Similarly, the odd numbers are 1, 3, 5, 7, 9, 11, which is also six. So, each die has a 50-50 chance of landing on an even or odd number. That means the probability of rolling an even number on a single die is 6/12, which simplifies to 1/2. The same goes for the probability of rolling an odd number.\n\nNow, Ben is rolling five of these dice, and we want the probability that exactly two show an even number. This sounds like a binomial probability problem because each die roll is an independent trial with two possible outcomes: success (even) or failure (odd). In binomial problems, we use the formula:\n\nP(k) = C(n, k) * p^k * (1-p)^(n-k)\n\nWhere:\n- P(k) is the probability of exactly k successes,\n- C(n, k) is the combination of n things taken k at a time,\n- p is the probability of success on a single trial,\n- n is the number of trials.\n\nIn this case, n is 5 (since there are five dice), k is 2 (we want exactly two evens), p is 1/2 (probability of rolling an even number), and (1-p) is also 1/2.\n\nSo, let me plug these values into the formula. First, I need to calculate C(5, 2), which is the number of ways to choose 2 successes out of 5 trials. The combination formula is C(n, k) = n! / (k! * (n - k)!), where \"!\" denotes factorial.\n\nCalculating C(5, 2):\n5! = 5 × 4 × 3 × 2 × 1 = 120\n2! = 2 × 1 = 2\n(5 - 2)! = 3! = 3 × 2 × 1 = 6\nSo, C(5, 2) = 120 / (2 * 6) = 120 / 12 = 10.\n\nNext, p^k is (1/2)^2, which is 1/4. Then, (1-p)^(n - k) is (1/2)^(5 - 2) = (1/2)^3 = 1/8.\n\nNow, multiply all these together: 10 * (1/4) * (1/8). Let's compute that step by step.\n\nFirst, multiply 10 and 1/4: 10 * 1/4 = 10/4 = 2.5. Then, multiply 2.5 by 1/8: 2.5 * 1/8 = 2.5 / 8 = 0.3125.\n\nAlternatively, in fractional terms, 10 * (1/4) * (1/8) = 10 * (1/32) = 10/32. Simplifying that fraction, both numerator and denominator are divisible by 2: 10 ÷ 2 = 5, 32 ÷ 2 = 16. So, 5/16. Converting that to decimal, 5 ÷ 16 = 0.3125, which matches what I got earlier.\n\nSo, the probability is 5/16 or 0.3125. To express this as a percentage, it would be 31.25%, but since the question doesn't specify, either form is acceptable. However, in probability terms, fractions are often preferred, especially if they are simple.\n\nWait a second, let me just make sure I didn't make a mistake in calculating the combination. Sometimes it's easy to mix up the numbers. So, C(5, 2) is 10 because there are 10 ways to choose 2 dice out of 5 to be even. For example, if the dice are labeled A, B, C, D, E, the possible pairs are AB, AC, AD, AE, BC, BD, BE, CD, CE, DE. That's 10 pairs, so yes, 10 is correct.\n\nAnother way to think about it: when rolling five dice, the number of possible outcomes is 12^5, but since each die is independent, and we're dealing with binary outcomes (even or odd), each die has 2 possibilities, so the total number of possible outcomes in terms of even/odd is 2^5 = 32. The number of favorable outcomes where exactly two are even is C(5, 2) = 10, so the probability is 10/32, which simplifies to 5/16. Yep, that checks out.\n\nAlternatively, if I think in terms of each die having 12 sides, the probability of exactly two evens would be calculated by considering the number of ways to choose which two dice are even, times the probability that those two are even and the other three are odd. Since each die has 6 even and 6 odd sides, the probability for each specific outcome would be (6/12)^2 * (6/12)^3, which is (1/2)^2 * (1/2)^3 = (1/4) * (1/8) = 1/32. Then, multiply by the number of combinations, which is 10, so 10 * 1/32 = 10/32 = 5/16. Yep, same result.\n\nI think that's solid. So, the probability is 5/16.\n</think>\n\nThe probability that exactly two of the five dice show an even number is calculated using the binomial probability formula. Each die has a 1/2 chance of landing even or odd. The number of ways to choose 2 successes out of 5 trials is C(5,2) = 10. The probability is then 10 * (1/2)^2 * (1/2)^3 = 10/32 = 5/16.\n\n$\\boxed{\\dfrac{5}{16}}$",
    "answer": "\\dfrac{5}{16}",
    "is_correct": true
  }
]