[
  {
    "seed": 0,
    "solution": "Solve this math problem step by step. Put your final answer in \\boxed{}. Problem: 23 people attend a party. Each person shakes hands with at most 22 other people. What is the maximum possible number of handshakes, assuming that any two people can shake hands at most once? Solution: \n<think>\nOkay, so I've got this math problem here: 23 people attend a party, and each person can shake hands with up to 22 others. I need to find the maximum possible number of handshakes, assuming that any two people can only shake hands once. Hmm, let me think about how to approach this.\n\nFirst, I remember that when dealing with handshakes and maximum numbers, it's often related to graph theory. Each person can be represented as a node, and each handshake as an edge connecting two nodes. So, in this case, we're looking for the maximum number of edges in a graph with 23 nodes where each node can have a degree of up to 22. That makes sense because each person can shake hands with up to 22 others.\n\nNow, in graph theory, the maximum number of edges in a complete graph (where every node is connected to every other node) is given by the formula n(n-1)/2, where n is the number of nodes. Let me verify that. If each of the 23 people shakes hands with 22 others, that would be 23*22, but since each handshake is counted twice (once for each participant), we need to divide by 2. So, the formula would indeed be 23*22/2.\n\nWait, let me make sure I'm not missing anything here. The problem says each person can shake hands with at most 22 others, which is the maximum possible in a group of 23, since you can't shake hands with yourself. So, if everyone shakes hands with everyone else, that should give the maximum number of handshakes without any restrictions beyond the problem's statement.\n\nSo, plugging the numbers into the formula: 23 multiplied by 22 is... let me calculate that. 23*20 is 460, and 23*2 is 46, so adding those together gives 460 + 46 = 506. Then, dividing by 2, we get 506/2 = 253.\n\nWait a second, that seems right, but let me double-check my multiplication to be sure. 23 times 22: 20 times 22 is 440, and 3 times 22 is 66, so 440 + 66 is indeed 506. Divided by 2 gives 253. So, the maximum number of handshakes would be 253.\n\nI don't think there's any way to get more than that because if every possible handshake happens exactly once, you can't have more than that number. So, yeah, I think 253 is the correct answer.\n</think>\n\nThe problem involves finding the maximum number of handshakes at a party with 23 people, where each person can shake hands with up to 22 others. Using graph theory, each handshake is an edge between two nodes (people). The maximum number of edges in a complete graph with 23 nodes is calculated using the formula n(n-1)/2, where n=23. \n\nCalculations:\n23 * 22 = 506\n506 / 2 = 253\n\nFinal Answer: The maximum possible number of handshakes is \\boxed{253}.",
    "answer": "253",
    "is_correct": true
  }
]