[
  {
    "seed": 0,
    "solution": "Solve this math problem step by step. Put your final answer in \\boxed{}. Problem: How many three-digit numbers are composed of three distinct digits such that one digit is the average of the other two? Solution: \n<think>\nOkay, so I need to figure out how many three-digit numbers have three distinct digits where one digit is the average of the other two. Hmm, let me start by understanding the problem.\n\nFirst, a three-digit number means the number ranges from 100 to 999. Each digit must be unique, so no repeating digits. Also, one of the digits has to be the average of the other two. That means if the digits are a, b, and c, then one of them, say c, should be equal to (a + b)/2. So, c is the average of a and b.\n\nLet me think about how to approach this. Maybe I can consider the digits as a, b, and c, where a, b, c are distinct, and one of them is the average of the other two. So, I can write that as c = (a + b)/2, which implies that a + b = 2c. So, the sum of two digits is twice the third digit.\n\nBut wait, since a, b, and c are digits, they can be from 0 to 9, but the first digit (let's say it's a) can't be 0 because it's a three-digit number. So, a is from 1 to 9, and b and c can be from 0 to 9, but all three must be distinct.\n\nI think I can break this problem down by considering each possible digit as the average and then find the possible pairs that satisfy the condition. So, maybe I can fix one digit as the average and find all pairs of digits that average to it.\n\nLet me try that. Let's consider each digit from 0 to 9 as the average digit, say m. Then, m must be the average of two other digits, so the two digits must add up to 2m. So, the two digits are x and y, where x + y = 2m, and x and y are distinct digits different from m.\n\nBut I also need to ensure that when I form the three-digit number, the first digit is not zero. So, I have to be careful about that.\n\nLet me structure this step by step.\n\n1. For each digit m from 0 to 9:\n   a. Find all pairs of distinct digits (x, y) such that x + y = 2m and x ≠ y ≠ m.\n   b. For each such pair, form all possible three-digit numbers using m, x, y, ensuring that the first digit is not zero.\n   c. Count all these valid numbers.\n\nWait, but m can't be zero because if m is zero, then x + y = 0, which would require both x and y to be zero, but they have to be distinct and different from m, which is zero. So, m can't be zero because that would require x and y to be zero, which isn't allowed since digits must be distinct. So, m can be from 1 to 9.\n\nWait, no, actually, m can be zero, but then x and y would have to be zero, which isn't allowed because they must be distinct and different from m. So, m cannot be zero. Therefore, m ranges from 1 to 9.\n\nWait, but let me check. If m is zero, then x + y = 0, so x and y must both be zero, but since x and y must be distinct and not equal to m (which is zero), that's impossible. So, m cannot be zero. So, m is from 1 to 9.\n\nSo, I'll loop through m from 1 to 9.\n\nFor each m, I need to find all pairs (x, y) where x + y = 2m, x ≠ y, and neither x nor y is equal to m.\n\nAlso, since x and y are digits, they must be between 0 and 9, inclusive.\n\nLet me take an example. Let's say m = 1. Then 2m = 2. So, x + y = 2. The possible pairs (x, y) where x and y are distinct digits not equal to 1 are:\n\n0 + 2 = 2, but 0 is allowed as long as it's not the first digit. So, the pair (0,2) is valid. Are there others? Let's see: 1 + 1 = 2, but x and y can't be 1 because m is 1, and they have to be distinct. So, only (0,2) and (2,0). But since order matters when forming numbers, but when counting pairs, we can consider unordered pairs. Wait, but in this case, since we're forming numbers, the order matters, but for the pair (x, y), we can consider them as two distinct digits, so for m=1, the only valid pair is (0,2). So, the digits are 0, 1, 2.\n\nBut wait, the three-digit number can't start with 0, so when forming numbers, we have to make sure that the first digit is either 1 or 2.\n\nWait, but let me proceed step by step.\n\nSo, for m=1:\n\nPossible pairs (x, y) where x + y = 2, x ≠ y, x ≠ 1, y ≠ 1.\n\nPossible pairs: (0,2) and (2,0). But since x and y are digits, and order matters in the number, but for the pair, I think we can consider them as sets, so {0,2} is the only pair.\n\nSo, the digits are 0,1,2.\n\nNow, how many three-digit numbers can we form with these digits where the first digit is not zero.\n\nThe digits are 0,1,2. So, the first digit can be 1 or 2. The other two digits can be arranged in any order, including zero.\n\nSo, number of permutations:\n\nFirst digit: 2 choices (1 or 2)\n\nThe other two digits: 2! = 2 permutations.\n\nSo, total numbers: 2 * 2 = 4.\n\nSo, for m=1, we have 4 numbers.\n\nLet me list them to verify:\n\n102, 120, 201, 210.\n\nYes, that's 4 numbers.\n\nOkay, so that seems correct.\n\nNow, let's try m=2.\n\n2m = 4. So, x + y = 4.\n\nPossible pairs (x, y) where x ≠ y, x ≠ 2, y ≠ 2.\n\nPossible pairs:\n\n0 + 4 = 4: (0,4)\n\n1 + 3 = 4: (1,3)\n\n3 + 1 = 4: same as above.\n\n4 + 0 = 4: same as first.\n\nSo, the pairs are {0,4} and {1,3}.\n\nSo, for m=2, we have two sets of digits:\n\nFirst set: 0,2,4\n\nSecond set: 1,2,3\n\nWait, no. Wait, m=2 is the average, so the digits are m, x, y, which are 2, and the pair x,y. So, for the first pair {0,4}, the digits are 0,2,4. For the second pair {1,3}, the digits are 1,2,3.\n\nSo, two different sets of digits.\n\nNow, for each set, we can form numbers.\n\nFirst set: 0,2,4.\n\nNumber of three-digit numbers: first digit can't be 0, so first digit can be 2 or 4. Then, the other two digits can be arranged in any order.\n\nSo, first digit: 2 choices (2 or 4)\n\nOther two digits: 2! = 2 permutations.\n\nTotal: 2 * 2 = 4 numbers.\n\nSimilarly, for the second set: 1,2,3.\n\nDigits are 1,2,3. All non-zero, so first digit can be any of them.\n\nNumber of permutations: 3! = 6.\n\nSo, total numbers for m=2: 4 + 6 = 10.\n\nWait, but let me check.\n\nWait, for the first set: 0,2,4, the numbers would be 204, 240, 402, 420. That's 4 numbers.\n\nFor the second set: 1,2,3, the numbers are 123, 132, 213, 231, 312, 321. That's 6 numbers.\n\nSo, total 10 numbers for m=2.\n\nOkay, that seems correct.\n\nNow, moving on to m=3.\n\n2m=6. So, x + y =6.\n\nPossible pairs (x,y) where x ≠ y, x ≠3, y ≠3.\n\nPossible pairs:\n\n0 +6=6: (0,6)\n\n1 +5=6: (1,5)\n\n2 +4=6: (2,4)\n\n4 +2=6: same as above.\n\n5 +1=6: same as above.\n\n6 +0=6: same as above.\n\nSo, the pairs are {0,6}, {1,5}, {2,4}.\n\nSo, three sets of digits:\n\nFirst set: 0,3,6\n\nSecond set:1,3,5\n\nThird set:2,3,4\n\nNow, for each set:\n\nFirst set: 0,3,6.\n\nNumbers: first digit can be 3 or 6.\n\nFirst digit: 2 choices.\n\nOther two digits: 2! = 2 permutations.\n\nTotal: 2*2=4 numbers.\n\nSecond set:1,3,5.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations: 3! =6.\n\nThird set:2,3,4.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations: 6.\n\nSo, total numbers for m=3: 4 +6 +6=16.\n\nWait, let me check.\n\nFirst set: 0,3,6: numbers are 306, 360, 603, 630. That's 4.\n\nSecond set:1,3,5: numbers are 135, 153, 315, 351, 513, 531. 6 numbers.\n\nThird set:2,3,4: numbers are 234, 243, 324, 342, 423, 432. 6 numbers.\n\nTotal: 4+6+6=16.\n\nYes, that's correct.\n\nOkay, moving on to m=4.\n\n2m=8. So, x + y=8.\n\nPossible pairs (x,y) where x ≠ y, x ≠4, y ≠4.\n\nPossible pairs:\n\n0 +8=8: (0,8)\n\n1 +7=8: (1,7)\n\n2 +6=8: (2,6)\n\n3 +5=8: (3,5)\n\n5 +3=8: same as above.\n\n6 +2=8: same as above.\n\n7 +1=8: same as above.\n\n8 +0=8: same as above.\n\nSo, the pairs are {0,8}, {1,7}, {2,6}, {3,5}.\n\nSo, four sets of digits:\n\nFirst set:0,4,8\n\nSecond set:1,4,7\n\nThird set:2,4,6\n\nFourth set:3,4,5\n\nNow, for each set:\n\nFirst set:0,4,8.\n\nNumbers: first digit can be 4 or 8.\n\nFirst digit:2 choices.\n\nOther two digits:2! =2 permutations.\n\nTotal:2*2=4 numbers.\n\nSecond set:1,4,7.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:3! =6.\n\nThird set:2,4,6.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nFourth set:3,4,5.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nSo, total numbers for m=4:4 +6 +6 +6=22.\n\nWait, let me verify.\n\nFirst set:0,4,8: numbers are 408, 480, 804, 840. 4 numbers.\n\nSecond set:1,4,7: numbers are 147, 174, 417, 471, 714, 741. 6 numbers.\n\nThird set:2,4,6: numbers are 246, 264, 426, 462, 624, 642. 6 numbers.\n\nFourth set:3,4,5: numbers are 345, 354, 435, 453, 534, 543. 6 numbers.\n\nTotal:4+6+6+6=22. Correct.\n\nOkay, moving on to m=5.\n\n2m=10. So, x + y=10.\n\nPossible pairs (x,y) where x ≠ y, x ≠5, y ≠5.\n\nPossible pairs:\n\n0 +10=10: but 10 is not a digit, so invalid.\n\n1 +9=10: (1,9)\n\n2 +8=10: (2,8)\n\n3 +7=10: (3,7)\n\n4 +6=10: (4,6)\n\n6 +4=10: same as above.\n\n7 +3=10: same as above.\n\n8 +2=10: same as above.\n\n9 +1=10: same as above.\n\nSo, the pairs are {1,9}, {2,8}, {3,7}, {4,6}.\n\nSo, four sets of digits:\n\nFirst set:1,5,9\n\nSecond set:2,5,8\n\nThird set:3,5,7\n\nFourth set:4,5,6\n\nNow, for each set:\n\nFirst set:1,5,9.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:3! =6.\n\nSecond set:2,5,8.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nThird set:3,5,7.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nFourth set:4,5,6.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nSo, total numbers for m=5:6+6+6+6=24.\n\nWait, let me check.\n\nFirst set:1,5,9: numbers are 159,195,519,591,915,951. 6 numbers.\n\nSecond set:2,5,8: numbers are 258,285,528,582,825,852. 6 numbers.\n\nThird set:3,5,7: numbers are 357,375,537,573,735,753. 6 numbers.\n\nFourth set:4,5,6: numbers are 456,465,546,564,645,654. 6 numbers.\n\nTotal:6+6+6+6=24. Correct.\n\nMoving on to m=6.\n\n2m=12. So, x + y=12.\n\nPossible pairs (x,y) where x ≠ y, x ≠6, y ≠6.\n\nPossible pairs:\n\n3 +9=12: (3,9)\n\n4 +8=12: (4,8)\n\n5 +7=12: (5,7)\n\n6 +6=12: invalid because x ≠ y.\n\n7 +5=12: same as above.\n\n8 +4=12: same as above.\n\n9 +3=12: same as above.\n\nSo, the pairs are {3,9}, {4,8}, {5,7}.\n\nSo, three sets of digits:\n\nFirst set:3,6,9\n\nSecond set:4,6,8\n\nThird set:5,6,7\n\nNow, for each set:\n\nFirst set:3,6,9.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:3! =6.\n\nSecond set:4,6,8.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nThird set:5,6,7.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nSo, total numbers for m=6:6+6+6=18.\n\nWait, let me verify.\n\nFirst set:3,6,9: numbers are 369,396,639,693,936,963. 6 numbers.\n\nSecond set:4,6,8: numbers are 468,486,648,684,846,864. 6 numbers.\n\nThird set:5,6,7: numbers are 567,576,657,675,756,765. 6 numbers.\n\nTotal:6+6+6=18. Correct.\n\nNow, m=7.\n\n2m=14. So, x + y=14.\n\nPossible pairs (x,y) where x ≠ y, x ≠7, y ≠7.\n\nPossible pairs:\n\n5 +9=14: (5,9)\n\n6 +8=14: (6,8)\n\n7 +7=14: invalid.\n\n8 +6=14: same as above.\n\n9 +5=14: same as above.\n\nSo, the pairs are {5,9}, {6,8}.\n\nSo, two sets of digits:\n\nFirst set:5,7,9\n\nSecond set:6,7,8\n\nNow, for each set:\n\nFirst set:5,7,9.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:3! =6.\n\nSecond set:6,7,8.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:6.\n\nSo, total numbers for m=7:6+6=12.\n\nLet me check.\n\nFirst set:5,7,9: numbers are 579,597,759,795,957,975. 6 numbers.\n\nSecond set:6,7,8: numbers are 678,687,768,786,867,876. 6 numbers.\n\nTotal:6+6=12. Correct.\n\nNext, m=8.\n\n2m=16. So, x + y=16.\n\nPossible pairs (x,y) where x ≠ y, x ≠8, y ≠8.\n\nPossible pairs:\n\n7 +9=16: (7,9)\n\n8 +8=16: invalid.\n\n9 +7=16: same as above.\n\nSo, the only pair is {7,9}.\n\nSo, the set of digits is 7,8,9.\n\nAll digits non-zero, so first digit can be any of the three.\n\nNumber of permutations:3! =6.\n\nSo, numbers are 789,798,879,897,978,987. 6 numbers.\n\nSo, total numbers for m=8:6.\n\nFinally, m=9.\n\n2m=18. So, x + y=18.\n\nPossible pairs (x,y) where x ≠ y, x ≠9, y ≠9.\n\nPossible pairs:\n\n9 +9=18: invalid because x ≠ y.\n\nSo, no valid pairs because the only way to get 18 is 9+9, which is invalid. So, no numbers for m=9.\n\nSo, m=9 contributes nothing.\n\nNow, let me summarize the counts for each m:\n\nm=1:4\n\nm=2:10\n\nm=3:16\n\nm=4:22\n\nm=5:24\n\nm=6:18\n\nm=7:12\n\nm=8:6\n\nm=9:0\n\nNow, let's add them up.\n\n4 +10=14\n\n14 +16=30\n\n30 +22=52\n\n52 +24=76\n\n76 +18=94\n\n94 +12=106\n\n106 +6=112\n\n112 +0=112\n\nSo, total numbers:112.\n\nWait, but let me double-check the addition:\n\nm=1:4\n\nm=2:10 → total 14\n\nm=3:16 → 14+16=30\n\nm=4:22 → 30+22=52\n\nm=5:24 →52+24=76\n\nm=6:18 →76+18=94\n\nm=7:12 →94+12=106\n\nm=8:6 →106+6=112\n\nm=9:0 →112+0=112\n\nYes, total 112.\n\nWait, but I'm concerned that I might have double-counted some numbers because a number could satisfy the condition in more than one way. For example, maybe a number like 123 could be considered as m=2 because 2 is the average of 1 and 3, but also maybe another m. Wait, no, because each number has only one middle digit, but actually, no, because the digits can be arranged in any order, so maybe a number could be formed from different sets. Hmm, but in my approach, I considered each m separately and counted the numbers formed from that m, but I might have counted some numbers multiple times if they can be formed in more than one way.\n\nWait, for example, let's take the number 123. Here, 2 is the average of 1 and 3. So, it's counted under m=2. Is there another m where 123 could be formed? Let's see: Is there another digit in 123 that is the average of the other two? 1 is the average of 2 and 0, but 0 isn't in the number. 3 is the average of 0 and 6, which isn't in the number. So, no, 123 is only counted once under m=2.\n\nAnother example: 345. Here, 4 is the average of 3 and 5, so it's under m=4. Is there another m? 3 is the average of 0 and 6, which isn't in the number. 5 is the average of 0 and 10, which isn't a digit. So, no, only counted once.\n\nWait, but let's think of a number like 135. Here, 3 is the average of 1 and 5. So, under m=3. Also, 1 is the average of 0 and 2, but 0 and 2 aren't both in the number. Similarly, 5 is the average of 0 and 10, which isn't valid. So, only counted once.\n\nWait, but what about a number like 246. Here, 4 is the average of 2 and 6. So, under m=4. Also, 2 is the average of 0 and 4, but 0 isn't in the number. 6 is the average of 3 and 9, which isn't in the number. So, only counted once.\n\nWait, another example: 123. Wait, I think I've already covered that.\n\nWait, perhaps another number: 147. Here, 4 is the average of 1 and 7. So, under m=4. Also, 1 is the average of 0 and 2, which aren't in the number. 7 is the average of 5 and 9, which aren't in the number. So, only counted once.\n\nWait, but let's consider a number like 204. Here, 2 is the average of 0 and 4, so under m=2. Also, 0 is the average of -2 and 2, but negative digits aren't allowed. 4 is the average of 0 and 8, which isn't in the number. So, only counted once.\n\nWait, maybe I'm overcomplicating. Since each number is formed by a specific set of digits where one digit is the average, and each set is unique to that m, I think there's no overlap. Therefore, the total count should be accurate.\n\nWait, but let me think again. Suppose a number like 135. It's formed under m=3 because 3 is the average of 1 and 5. But could it also be formed under another m? Let's see: 1 is not the average of any other two digits in the number, and 5 is not the average either. So, no.\n\nAnother example: 159. Here, 5 is the average of 1 and 9. So, under m=5. Could it be formed under another m? 1 is the average of 0 and 2, which aren't in the number. 9 is the average of 7 and 11, which isn't valid. So, no.\n\nWait, but let me consider a number like 246. It's under m=4 because 4 is the average of 2 and 6. Could it also be under m=3? Let's see: 3 would require two digits that add up to 6, but the digits are 2,4,6. 2 and 4 add up to 6, so 3 is the average of 2 and 4. Wait, so in this case, 246 has two possible m's: 4 (since 4 is the average of 2 and 6) and 3 (since 3 is the average of 2 and 4). So, this number would be counted twice in my previous calculation.\n\nOh no, that's a problem. So, I have to adjust for such overlaps.\n\nWait, so 246 is counted under m=4 because 4 is the average of 2 and 6, and also under m=3 because 3 is the average of 2 and 4. So, this number would have been counted twice in my total of 112.\n\nSimilarly, are there other numbers that can be formed in two different ways?\n\nLet me check another number. How about 135. Under m=3, because 3 is the average of 1 and 5. Also, 1 is the average of 0 and 2, but 0 isn't in the number. 5 is the average of 0 and 10, which isn't valid. So, only counted once.\n\nWait, but 246 is a problem because it's counted under both m=3 and m=4.\n\nSimilarly, let's take another number: 246.\n\nWait, under m=4, the digits are 2,4,6, so it's counted there.\n\nUnder m=3, the digits are 2,3,4, but 6 isn't in that set. Wait, no, wait. When m=3, the pair is {2,4} because 2 +4=6, which is 2m=6. So, the digits are 2,3,4. So, 246 would not be formed under m=3 because 6 isn't in that set. Wait, but 246 is formed from digits 2,4,6, which are under m=4. So, perhaps I was mistaken earlier.\n\nWait, let me clarify. For m=3, the pair is {2,4}, so the digits are 2,3,4. So, the number 246 would not be formed under m=3 because 6 isn't part of that set. So, 246 is only formed under m=4.\n\nWait, but earlier I thought that 3 is the average of 2 and 4, but in that case, the digits would be 2,3,4, so the number would be 234, 243, 324, 342, 423, 432. So, 246 isn't formed under m=3 because 6 isn't in that set.\n\nWait, so perhaps 246 is only formed under m=4. So, maybe there's no overlap. Let me check another number.\n\nHow about 159? Under m=5, because 5 is the average of 1 and 9. Also, could it be under m=8? 8 would require two digits that add up to 16, but 1 +9=10, which isn't 16. So, no.\n\nWait, another number: 369. Under m=6, because 6 is the average of 3 and 9. Also, could it be under m=9? 9 would require two digits that add up to 18, which would be 9 and 9, but they have to be distinct. So, no.\n\nWait, maybe I was wrong earlier about 246 being counted twice. It seems that each number is only counted once because the set of digits is unique to each m.\n\nWait, let me think again. If a number has three digits, a, b, c, and one of them is the average of the other two, then that average is unique. Because if, say, a is the average of b and c, then b + c = 2a. Similarly, if b is the average of a and c, then a + c = 2b. But can both be true? Let's see.\n\nSuppose a is the average of b and c: b + c = 2a.\n\nAnd b is the average of a and c: a + c = 2b.\n\nSo, from the first equation: b + c = 2a.\n\nFrom the second equation: a + c = 2b.\n\nSubtracting the second equation from the first: (b + c) - (a + c) = 2a - 2b → b - a = 2a - 2b → b - a = 2a - 2b → Let's rearrange: b + 2b = 2a + a → 3b = 3a → b = a.\n\nBut if b = a, then from the first equation: a + c = 2a → c = a. So, all three digits would be equal, which contradicts the distinctness. Therefore, a number cannot have two different m's where two different digits are the average of the other two. Therefore, each number is counted exactly once in the total count.\n\nTherefore, my initial total of 112 is correct.\n\nWait, but earlier I thought that 246 could be under both m=3 and m=4, but upon closer inspection, it's only under m=4 because m=3 would require the digits 2,3,4, not 2,4,6. So, no overlap.\n\nTherefore, the total number of such three-digit numbers is 112.\n\nWait, but let me just make sure I didn't miss any m or any pair.\n\nWait, going back through each m:\n\nm=1:4\n\nm=2:10\n\nm=3:16\n\nm=4:22\n\nm=5:24\n\nm=6:18\n\nm=7:12\n\nm=8:6\n\nm=9:0\n\nAdding up to 112.\n\nYes, that seems correct.\n\nSo, the final answer is 112.\n</think>\n\nTo solve the problem of finding how many three-digit numbers have three distinct digits where one digit is the average of the other two, we can break down the solution as follows:\n\n1. **Identify the condition**: For digits a, b, c, one digit must be the average of the other two. This implies that for some permutation of a, b, c, one digit is (a + b)/2.\n\n2. **Consider each digit as the average (m)**: For each digit m from 1 to 9 (since m=0 would require other digits to be 0, which isn't allowed), find all pairs (x, y) such that x + y = 2m and x ≠ y ≠ m.\n\n3. **Count valid three-digit numbers**:\n   - For each valid set of digits {m, x, y}, count the number of valid three-digit numbers where the first digit isn't zero.\n\n4. **Sum the counts for each m**:\n   - m=1: 4 numbers\n   - m=2: 10 numbers\n   - m=3: 16 numbers\n   - m=4: 22 numbers\n   - m=5: 24 numbers\n   - m=6: 18 numbers\n   - m=7: 12 numbers\n   - m=8: 6 numbers\n   - m=9: 0 numbers\n\n5. **Total count**: Summing these gives 112 valid three-digit numbers.\n\n**Answer**: The total number of such three-digit numbers is \\boxed{112}.",
    "answer": "112",
    "is_correct": true
  }
]