[
  {
    "seed": 0,
    "solution": "Solve this math problem step by step. Put your final answer in \\boxed{}. Problem: Sarah's bowling score was 40 points more than Greg's, and the average of their two scores was 102. What was Sarah's score? (Recall that the average of two numbers is their sum divided by 2.) Solution: \n<think>\nOkay, so I've got this math problem here about Sarah and Greg's bowling scores. Let me try to figure it out step by step. First, I'll read the problem again to make sure I understand it.\n\nSarah's bowling score was 40 points more than Greg's, and the average of their two scores was 102. I need to find out what Sarah's score was. Hmm, okay, so we're dealing with two people's scores, and there's a relationship between them and an average given.\n\nAlright, let's break this down. I know that the average of two numbers is the sum of those numbers divided by 2. So if I let Sarah's score be one number and Greg's score be another, their average would be (Sarah's score + Greg's score) divided by 2, and that equals 102.\n\nAlso, the problem says Sarah's score was 40 points more than Greg's. So if I let Greg's score be a variable, say G, then Sarah's score would be G plus 40. That makes sense.\n\nSo let me assign variables to make this clearer. Let me call Greg's score G. Then Sarah's score would be G + 40. Now, since the average of their scores is 102, I can write an equation based on that information.\n\nThe average formula is (Sarah's score + Greg's score) divided by 2 equals 102. So plugging in the variables I have, that would be (G + (G + 40)) / 2 = 102.\n\nLet me write that out more clearly: (G + (G + 40)) / 2 = 102. Now, I can simplify the numerator first. G plus G is 2G, and then plus 40. So the equation becomes (2G + 40) / 2 = 102.\n\nNow, I can simplify this further by dividing each term in the numerator by 2. So 2G divided by 2 is just G, and 40 divided by 2 is 20. So now the equation is G + 20 = 102.\n\nThat seems manageable. Now, to solve for G, I can subtract 20 from both sides of the equation. So G + 20 - 20 = 102 - 20, which simplifies to G = 82.\n\nWait, so Greg's score is 82. Now, since Sarah's score is 40 points more than Greg's, I can find Sarah's score by adding 40 to Greg's score. So Sarah's score would be 82 + 40, which is 122.\n\nLet me check my work to make sure I didn't make a mistake. So if Greg scored 82 and Sarah scored 122, their average would be (82 + 122) divided by 2. Let's calculate that: 82 + 122 is 204, and 204 divided by 2 is indeed 102. That matches the given average, so that seems correct.\n\nAlso, checking the difference: Sarah's score minus Greg's score is 122 - 82, which is 40. That also matches the problem statement, so both conditions are satisfied.\n\nWait a second, let me just go through the steps again to make sure I didn't skip anything or make any calculation errors. So starting with the average: (Sarah + Greg)/2 = 102, so Sarah + Greg = 204. Then, since Sarah is 40 more than Greg, Sarah = Greg + 40. So substituting that into the sum: Greg + 40 + Greg = 204, which is 2Greg + 40 = 204. Subtract 40 from both sides: 2Greg = 164, then Greg = 82. Then Sarah is 82 + 40 = 122. Yep, that all checks out.\n\nI think that's solid. So Sarah's score is 122. I don't see any mistakes in the reasoning or calculations. It's always good to verify, especially when dealing with word problems, because it's easy to misinterpret the relationships. But in this case, I think I got it right.\n\nJust to recap: We set up the variables correctly, translated the words into mathematical expressions, solved the equations step by step, and then verified the solution against the original problem to ensure it makes sense. That's a good process to follow when solving word problems to avoid errors.\n</think>\n\nSarah's bowling score was 40 points more than Greg's, and the average of their two scores was 102. To find Sarah's score, let's denote Greg's score as G. Then, Sarah's score is G + 40. The average of their scores is given by:\n\n\\[\n\\frac{G + (G + 40)}{2} = 102\n\\]\n\nSimplifying the equation:\n\n\\[\n\\frac{2G + 40}{2} = 102\n\\]\n\\[\nG + 20 = 102\n\\]\n\\[\nG = 82\n\\]\n\nThus, Sarah's score is:\n\n\\[\n82 + 40 = 122\n\\]\n\n**Answer:** Sarah's score was \\boxed{122}.",
    "answer": "122",
    "is_correct": true
  }
]